; domain
(define (domain intersection)
   (:requirements
        :equality
        :negative-preconditions
        :typing
    )

    (:types
        car loc num - object
        road spot - loc
    )

    (:constants
        
    )

    (:predicates
        (clear ?loc - loc)
        (at ?car - object ?loc - loc)
        (adjacent ?obj1 ?obj2 - object)
        (qpos ?car - object ?num - num) ; car's spot in queue to go through intersection
        (qstatus ?num) ; car that can/is going through the intersection
        (qnext ?num - num) ; next number to be assigned to a car that stops
        (left_turnable ?from ?rd0 ?rd1 ?rd2 ?exit - road)
        (turning_left ?car - car ?from ?rd0 ?rd1 ?rd2 ?exit - road)
        (turning_right ?car - car ?from ?rd1 ?exit - road)
		(turning_straight ?car - car ?from ?rd1 ?rd2 ?exit)
        (right_turnable ?from ?rd0 ?exit - road)
		(straight_turnable ?from ?rd1 ?rd2 ?exit)
        (stopped ?car - car)
        (stopsign ?loc - loc)
        (locked ?loc - loc)
    )
    
    (:action move
        :parameters (?car - car ?from - road ?to - road)
        :precondition (and (clear ?to) 
                           (at ?car ?from)
                           (adjacent ?from ?to)
        )
        :effect (and (not (clear ?to))
                     (not (at ?car ?from))
                     (clear ?from)
                     (at ?car ?to)
        )
    )
    
    (:action stop
        :parameters (?car - car ?loc - loc ?assign-q ?next-q - num)
        :precondition (and (not (stopped ?car))
                            (stopsign ?loc)
                            (at ?car ?loc)
                            (adjacent ?assign-q ?next-q)
                            (qnext ?assign-q)
                        )
        :effect (and (stopped ?car)
                     (qpos ?car ?assign-q)
                     (not (qnext ?assign-q))
                     (qnext ?next-q)
                )
    )
    
    (:action turn_left_0
        :parameters (?car - car ?from ?rd1 ?rd2 ?rd3 ?exit - road ?num - num)
        :precondition  (and 
                            (stopped ?car)
                            (at ?car ?from)
                            (left_turnable ?from ?rd1 ?rd2 ?rd3 ?exit)
                            (not 
                                (or 
                                    (locked ?rd1)
                                    (locked ?rd2)
                                    (locked ?rd3)
                                    (locked ?exit)
                                )
                            )
                            (clear ?rd1)
                            (clear ?rd2)
                            (clear ?rd3)
                            (clear ?exit)
                            (qstatus ?num)
                            (qpos ?car ?num)
                        )
        :effect (and
					(turning_left ?car ?from ?rd1 ?rd2 ?rd3 ?exit)
                    (not (stopped ?car))
                    (not (at ?car ?from))
                    (at ?car ?rd1)
                    (locked ?rd1)
                    (locked ?rd2)
                    (locked ?rd3)
                    (clear ?from)
                    (not (clear ?rd1))
                )
    )
    (:action turn_left_1
        :parameters (?car - car ?from ?rd1 ?rd2 ?rd3 ?exit - road ?num - num)
        :precondition  (and 
							(turning_left ?car ?from ?rd1 ?rd2 ?rd3 ?exit)
                            (at ?car ?rd1)
                            (left_turnable ?from ?rd1 ?rd2 ?rd3 ?exit)
                            (clear ?rd2)
                            (clear ?rd3)
                            (clear ?exit)
                            (qstatus ?num)
                            (qpos ?car ?num)
                        )
        :effect (and
                    (not (at ?car ?rd1))
                    (at ?car ?rd2)
                    (clear ?rd1)
                    (not (clear ?rd2))
                )
    )
    (:action turn_left_2
        :parameters (?car - car ?from ?rd1 ?rd2 ?rd3 ?exit - road ?num - num)
        :precondition  (and 
							(turning_left ?car ?from ?rd1 ?rd2 ?rd3 ?exit)
                            (at ?car ?rd2)
                            (left_turnable ?from ?rd1 ?rd2 ?rd3 ?exit)
                            (clear ?rd3)
                            (clear ?exit)
                            (qstatus ?num)
                            (qpos ?car ?num)
                        )
        :effect (and
                    (not (at ?car ?rd2))
                    (at ?car ?rd3)
                    (clear ?rd2)
                    (not (clear ?rd3))
                )
    )
    (:action turn_left_3
        :parameters (?car - car ?from ?rd1 ?rd2 ?rd3 ?exit - road ?qstate - num ?qinc - num)
        :precondition  (and 
							(turning_left ?car ?from ?rd1 ?rd2 ?rd3 ?exit)
                            (at ?car ?rd3)
                            (left_turnable ?from ?rd1 ?rd2 ?rd3 ?exit)
                            (clear ?exit)
                            (qstatus ?qstate)
                            (qpos ?car ?qstate)
							(adjacent ?qstate ?qinc)
                        )
        :effect (and
					(not (turning_left ?car ?from ?rd1 ?rd2 ?rd3 ?exit))
                    (not (at ?car ?rd3))
                    (at ?car ?exit)
                    (clear ?rd3)
                    (not (clear ?exit))
                    (not (locked ?rd1))
                    (not (locked ?rd2))
                    (not (locked ?rd3))
                    (not (qpos ?car ?qstate))
                    (not (qstatus ?qstate))
                    (qstatus ?qinc)
                )
    )
    (:action turn_right_0
            :parameters (?car - car ?from ?rd1 ?exit - road ?num - num)
            :precondition  (and 
                                (stopped ?car)
                                (at ?car ?from)
                                (right_turnable ?from ?rd1 ?exit)
                                (not 
                                    (or 
                                        (locked ?rd1)
                                        (locked ?exit)
                                    )
                                )
                                (clear ?rd1)
                                (clear ?exit)
                                (qstatus ?num)
                                (qpos ?car ?num)
                            )
            :effect (and
						(turning_right ?car ?from ?rd1 ?exit)
                        (not (stopped ?car))
                        (not (at ?car ?from))
                        (at ?car ?rd1)
                        (locked ?rd1)
                        (locked ?exit)
                        (clear ?from)
                        (not (clear ?rd1))
                    )
    )
    (:action turn_right_1
        :parameters (?car - car ?from ?rd1 ?exit - road ?qstate - num ?qinc - num)
        :precondition  (and 
							(turning_right ?car ?from ?rd1 ?exit)
                            (at ?car ?rd1)
                            (right_turnable ?from ?rd1 ?exit)
                            (clear ?exit)
                            (qpos ?car ?qstate)
                            (adjacent ?qstate ?qinc)
                        )
        :effect (and
					(not (turning_right ?car ?from ?rd1 ?exit))
                    (not (at ?car ?rd1))
                    (at ?car ?exit)
                    (clear ?rd1)
                    (not (clear ?exit))
                    (not (locked ?rd1))
                    (not (qpos ?car ?qstate))
                    (not (qstatus ?qstate))
                    (qstatus ?qinc)
                )
    )
(:action turn_straight_0
        :parameters (?car - car ?from ?rd1 ?rd2 ?exit - road ?num - num)
        :precondition  (and 
                            (stopped ?car)
                            (at ?car ?from)
                            (straight_turnable ?from ?rd1 ?rd2 ?exit)
                            (not 
                                (or 
                                    (locked ?rd1)
                                    (locked ?rd2)
                                    (locked ?exit)
                                )
                            )
                            (clear ?rd1)
                            (clear ?rd2)
                            (clear ?exit)
                            (qstatus ?num)
                            (qpos ?car ?num)
                        )
        :effect (and
					(turning_straight ?car ?from ?rd1 ?rd2 ?exit)
                    (not (stopped ?car))
                    (not (at ?car ?from))
                    (at ?car ?rd1)
                    (locked ?rd1)
                    (locked ?rd2)
                    (clear ?from)
                    (not (clear ?rd1))
                )
    )
    (:action turn_straight_1
        :parameters (?car - car ?from ?rd1 ?rd2 ?exit - road ?num - num)
        :precondition  (and 
							(turning_straight ?car ?from ?rd1 ?rd2 ?exit)
                            (at ?car ?rd1)
                            (straight_turnable ?from ?rd1 ?rd2 ?exit)
                            (clear ?rd2)
                            (clear ?exit)
                            (qstatus ?num)
                            (qpos ?car ?num)
                        )
        :effect (and
                    (not (at ?car ?rd1))
                    (at ?car ?rd2)
                    (clear ?rd1)
                    (not (clear ?rd2))
                )
    )
    (:action turn_straight_2
        :parameters (?car - car ?from ?rd1 ?rd2 ?exit - road ?qstate - num ?qinc - num)
        :precondition  (and 
							(turning_straight ?car ?from ?rd1 ?rd2 ?exit)
                            (at ?car ?rd2)
                            (straight_turnable ?from ?rd1 ?rd2 ?exit)
                            (clear ?exit)
                            (qstatus ?qstate)
                            (qpos ?car ?qstate)
							(adjacent ?qstate ?qinc)
                        )
        :effect (and
					(not (turning_straight ?car ?from ?rd1 ?rd2 ?exit))
                    (not (at ?car ?rd2))
                    (at ?car ?exit)
                    (clear ?rd2)
                    (not (clear ?exit))
                    (not (locked ?rd1))
                    (not (locked ?rd2))
                    (not (qpos ?car ?qstate))
                    (not (qstatus ?qstate))
                    (qstatus ?qinc)
                )
    )
)

; problem
; problem problem
(define (problem intersection-problem1)
    (:domain intersection)
    (:objects rd-0-3 rd-0-4 rd-1-3 rd-1-4 rd-2-3 rd-2-4 rd-3-0 rd-3-1 rd-3-2 rd-3-3 rd-3-4 rd-3-5 rd-3-6 rd-3-7 rd-4-0 rd-4-1 rd-4-2 rd-4-3 rd-4-4 rd-4-5 rd-4-6 rd-4-7 rd-5-3 rd-5-4 rd-6-3 rd-6-4 rd-7-3 rd-7-4 - road
              car-1 car-2 car-3 car-4 - car
              q-0 q-1 q-2 q-3 q-4 - num)
    (:init
    
           ; queues
           (adjacent q-0 q-1)
           (adjacent q-1 q-2)
           (adjacent q-2 q-3)
           (adjacent q-3 q-4)
           (adjacent q-4 q-0)
           
           (qstatus q-0)
           (qnext q-0)
           
           ; south side
           (adjacent rd-3-2 rd-3-1)
           (adjacent rd-3-1 rd-3-0)
           (adjacent rd-4-0 rd-4-1)
           (adjacent rd-4-1 rd-4-2)
           
           ; west side
           (adjacent rd-0-3 rd-1-3)
           (adjacent rd-1-3 rd-2-3)
           (adjacent rd-2-4 rd-1-4)
           (adjacent rd-1-4 rd-0-4)
           
           ; east side
           (adjacent rd-5-3 rd-6-3)
           (adjacent rd-6-3 rd-7-3)
           (adjacent rd-7-4 rd-6-4)
           (adjacent rd-6-4 rd-5-4)
           
           ; north side
           (adjacent rd-4-5 rd-4-6)
           (adjacent rd-4-6 rd-4-7)
           (adjacent rd-3-7 rd-3-6)
           (adjacent rd-3-6 rd-3-5)
           
           
           ; intersection
           (left_turnable rd-3-5 rd-3-4 rd-3-3 rd-4-3 rd-5-3)
           (left_turnable rd-4-2 rd-4-3 rd-4-4 rd-3-4 rd-2-4)
           (left_turnable rd-2-3 rd-3-3 rd-4-3 rd-4-4 rd-4-5)
           (left_turnable rd-5-4 rd-4-4 rd-3-4 rd-3-3 rd-3-2)
           (right_turnable rd-2-3 rd-3-3 rd-3-2)
           (right_turnable rd-4-2 rd-4-3 rd-5-3)
           (right_turnable rd-3-5 rd-3-4 rd-2-4)
           (right_turnable rd-5-4 rd-4-4 rd-4-5)
		   (straight_turnable rd-4-2 rd-4-3 rd-4-4 rd-4-5)
           
           ; Stop signs
           (stopsign rd-3-5)
           (stopsign rd-2-3)
           (stopsign rd-4-2)
           (stopsign rd-4-4)
           
           (clear rd-0-3)
           (clear rd-0-4)
           (clear rd-1-3)
           (clear rd-1-4)
           (clear rd-2-3)
           (clear rd-2-4)
           (clear rd-3-0)
           (clear rd-3-1)
           (clear rd-3-2)
           (clear rd-3-3)
           (clear rd-3-4)
           (clear rd-3-5)
           (clear rd-3-6)
           (clear rd-3-7)
           (clear rd-4-0)
           ;(clear rd-4-1)
		   ;(clear rd-4-2)
           (clear rd-4-3)
           (clear rd-4-4)
           (clear rd-4-5)
           (clear rd-4-6)
           (clear rd-4-7)
           (clear rd-5-3)
           (clear rd-5-4)
           (clear rd-6-3)
           (clear rd-6-4)
           (clear rd-7-3)
           (clear rd-7-4)
           
           ; initialize cars
           (at car-1 rd-4-2)
           (at car-2 rd-4-1)
           (at car-3 rd-3-5)
           (at car-4 rd-4-2)
           )
		   
    (:goal (and (at car-1 rd-0-4)
				(at car-2 rd-1-4)
				(at car-3 rd-7-3)
				(at car-4 rd-4-7)
		   )
	)
)

; plan
1. (stop car-3 rd-3-5 q-0 q-1)
   deleted: (qnext q-0)
   added: (stopped car-3) (qpos car-3 q-0) (qnext q-1)
   goals met: 0 of 4
2. (stop car-1 rd-4-2 q-1 q-2)
   deleted: (qnext q-1)
   added: (stopped car-1) (qpos car-1 q-1) (qnext q-2)
   goals met: 0 of 4
3. (turn_left_0 car-3 rd-3-5 rd-3-4 rd-3-3 rd-4-3 rd-5-3 q-0)
   deleted: (stopped car-3) (at car-3 rd-3-5) (clear rd-3-4)
   added: (turning_left car-3 rd-3-5 rd-3-4 rd-3-3 rd-4-3 rd-5-3) (at car-3 rd-3-4) (locked rd-3-4) (locked rd-3-3) (locked rd-4-3)
   goals met: 0 of 4
4. (turn_left_1 car-3 rd-3-5 rd-3-4 rd-3-3 rd-4-3 rd-5-3 q-0)
   deleted: (at car-3 rd-3-4) (clear rd-3-3)
   added: (at car-3 rd-3-3) (clear rd-3-4)
   goals met: 0 of 4
5. (turn_left_2 car-3 rd-3-5 rd-3-4 rd-3-3 rd-4-3 rd-5-3 q-0)
   deleted: (at car-3 rd-3-3) (clear rd-4-3)
   added: (at car-3 rd-4-3) (clear rd-3-3)
   goals met: 0 of 4
6. (turn_left_3 car-3 rd-3-5 rd-3-4 rd-3-3 rd-4-3 rd-5-3 q-0 q-1)
   deleted: (turning_left car-3 rd-3-5 rd-3-4 rd-3-3 rd-4-3 rd-5-3) (at car-3 rd-4-3) (clear rd-5-3) (locked rd-3-4) (locked rd-3-3) (locked rd-4-3) (qpos car-3 q-0) (qstatus q-0)
   added: (at car-3 rd-5-3) (clear rd-4-3) (qstatus q-1)
   goals met: 0 of 4
7. (move car-3 rd-5-3 rd-6-3)
   deleted: (clear rd-6-3) (at car-3 rd-5-3)
   added: (clear rd-5-3) (at car-3 rd-6-3)
   goals met: 0 of 4
8. (move car-3 rd-6-3 rd-7-3)
   deleted: (clear rd-7-3) (at car-3 rd-6-3)
   added: (clear rd-6-3) (at car-3 rd-7-3)
   goals met: 1 of 4
9. (turn_left_0 car-1 rd-4-2 rd-4-3 rd-4-4 rd-3-4 rd-2-4 q-1)
   deleted: (stopped car-1) (at car-1 rd-4-2) (clear rd-4-3)
   added: (turning_left car-1 rd-4-2 rd-4-3 rd-4-4 rd-3-4 rd-2-4) (at car-1 rd-4-3) (locked rd-4-3) (locked rd-4-4) (locked rd-3-4) (clear rd-4-2)
   goals met: 1 of 4
10. (turn_left_1 car-1 rd-4-2 rd-4-3 rd-4-4 rd-3-4 rd-2-4 q-1)
   deleted: (at car-1 rd-4-3) (clear rd-4-4)
   added: (at car-1 rd-4-4) (clear rd-4-3)
   goals met: 1 of 4
11. (turn_left_2 car-1 rd-4-2 rd-4-3 rd-4-4 rd-3-4 rd-2-4 q-1)
   deleted: (at car-1 rd-4-4) (clear rd-3-4)
   added: (at car-1 rd-3-4) (clear rd-4-4)
   goals met: 1 of 4
12. (turn_left_3 car-1 rd-4-2 rd-4-3 rd-4-4 rd-3-4 rd-2-4 q-1 q-2)
   deleted: (turning_left car-1 rd-4-2 rd-4-3 rd-4-4 rd-3-4 rd-2-4) (at car-1 rd-3-4) (clear rd-2-4) (locked rd-4-3) (locked rd-4-4) (locked rd-3-4) (qpos car-1 q-1) (qstatus q-1)
   added: (at car-1 rd-2-4) (clear rd-3-4) (qstatus q-2)
   goals met: 1 of 4
13. (move car-1 rd-2-4 rd-1-4)
   deleted: (clear rd-1-4) (at car-1 rd-2-4)
   added: (clear rd-2-4) (at car-1 rd-1-4)
   goals met: 1 of 4
14. (move car-1 rd-1-4 rd-0-4)
   deleted: (clear rd-0-4) (at car-1 rd-1-4)
   added: (clear rd-1-4) (at car-1 rd-0-4)
   goals met: 2 of 4
15. (stop car-4 rd-4-2 q-2 q-3)
   deleted: (qnext q-2)
   added: (stopped car-4) (qpos car-4 q-2) (qnext q-3)
   goals met: 2 of 4
16. (turn_straight_0 car-4 rd-4-2 rd-4-3 rd-4-4 rd-4-5 q-2)
   deleted: (stopped car-4) (at car-4 rd-4-2) (clear rd-4-3)
   added: (turning_straight car-4 rd-4-2 rd-4-3 rd-4-4 rd-4-5) (at car-4 rd-4-3) (locked rd-4-3) (locked rd-4-4)
   goals met: 2 of 4
17. (move car-2 rd-4-1 rd-4-2)
   deleted: (clear rd-4-2) (at car-2 rd-4-1)
   added: (clear rd-4-1) (at car-2 rd-4-2)
   goals met: 2 of 4
18. (turn_straight_1 car-4 rd-4-2 rd-4-3 rd-4-4 rd-4-5 q-2)
   deleted: (at car-4 rd-4-3) (clear rd-4-4)
   added: (at car-4 rd-4-4) (clear rd-4-3)
   goals met: 2 of 4
19. (turn_straight_2 car-4 rd-4-2 rd-4-3 rd-4-4 rd-4-5 q-2 q-3)
   deleted: (turning_straight car-4 rd-4-2 rd-4-3 rd-4-4 rd-4-5) (at car-4 rd-4-4) (clear rd-4-5) (locked rd-4-3) (locked rd-4-4) (qpos car-4 q-2) (qstatus q-2)
   added: (at car-4 rd-4-5) (clear rd-4-4) (qstatus q-3)
   goals met: 2 of 4
20. (move car-4 rd-4-5 rd-4-6)
   deleted: (clear rd-4-6) (at car-4 rd-4-5)
   added: (clear rd-4-5) (at car-4 rd-4-6)
   goals met: 2 of 4
21. (move car-4 rd-4-6 rd-4-7)
   deleted: (clear rd-4-7) (at car-4 rd-4-6)
   added: (clear rd-4-6) (at car-4 rd-4-7)
   goals met: 3 of 4
22. (stop car-2 rd-4-2 q-3 q-4)
   deleted: (qnext q-3)
   added: (stopped car-2) (qpos car-2 q-3) (qnext q-4)
   goals met: 3 of 4
23. (turn_left_0 car-2 rd-4-2 rd-4-3 rd-4-4 rd-3-4 rd-2-4 q-3)
   deleted: (stopped car-2) (at car-2 rd-4-2) (clear rd-4-3)
   added: (turning_left car-2 rd-4-2 rd-4-3 rd-4-4 rd-3-4 rd-2-4) (at car-2 rd-4-3) (locked rd-4-3) (locked rd-4-4) (locked rd-3-4) (clear rd-4-2)
   goals met: 3 of 4
24. (turn_left_1 car-2 rd-4-2 rd-4-3 rd-4-4 rd-3-4 rd-2-4 q-3)
   deleted: (at car-2 rd-4-3) (clear rd-4-4)
   added: (at car-2 rd-4-4) (clear rd-4-3)
   goals met: 3 of 4
25. (turn_left_2 car-2 rd-4-2 rd-4-3 rd-4-4 rd-3-4 rd-2-4 q-3)
   deleted: (at car-2 rd-4-4) (clear rd-3-4)
   added: (at car-2 rd-3-4) (clear rd-4-4)
   goals met: 3 of 4
26. (turn_left_3 car-2 rd-4-2 rd-4-3 rd-4-4 rd-3-4 rd-2-4 q-3 q-4)
   deleted: (turning_left car-2 rd-4-2 rd-4-3 rd-4-4 rd-3-4 rd-2-4) (at car-2 rd-3-4) (clear rd-2-4) (locked rd-4-3) (locked rd-4-4) (locked rd-3-4) (qpos car-2 q-3) (qstatus q-3)
   added: (at car-2 rd-2-4) (clear rd-3-4) (qstatus q-4)
   goals met: 3 of 4
27. (move car-2 rd-2-4 rd-1-4)
   deleted: (clear rd-1-4) (at car-2 rd-2-4)
   added: (clear rd-2-4) (at car-2 rd-1-4)
   goals met: 4 of 4
